#ifndef _START_H_
#define _START_H_

//================================
//函数名:login
//作者:marvin
//日期:2020.1.6
//功能:登录入口
//输入参数:sockfd
//返回值:void
//修改记录:
//================================
char login(int sockfd);

//================================
//函数名:regist
//作者:marvin
//日期:2020.1.6
//功能:登录入口
//输入参数:sockfd
//返回值:void
//修改记录:
//================================
char regist(int sockfd);

//================================
//函数名:alive_server
//作者:marvin
//日期:2020.1.5
//功能:心跳线程
//输入参数:
//返回值:void
//修改记录:
//================================
void* alive_server(void* arg);

//================================
//函数名:send_shell
//作者:marvin
//日期:2020.1.5
//功能:执行客户端发过来的shell
//输入参数:sockfd
//返回值:void
//修改记录:
//================================
void send_shell(int sockfd);

//================================
//函数名:read_mes
//作者:marvin
//日期:2020.1.5
//功能:
//输入参数:
//返回值:void
//修改记录:
//================================
void* read_mes(void* arg);

//================================
//函数名:chat_with
//作者:marvin
//日期:2020.1.5
//功能:聊天转发
//输入参数:sockfd
//返回值:void
//修改记录:
//================================
void chat_with(int sockfd);

//================================
//函数名:look_alive
//作者:marvin
//日期:2020.1.5
//功能:查看在线用户
//输入参数:sockfd
//返回值:void
//修改记录:
//================================
void look_alive(int sockfd);

//================================
//函数名:do_exit
//作者:marvin
//日期:2020.1.5
//功能:客户端退出
//输入参数:sockfd
//返回值:void
//修改记录:
//================================
void do_exit(int sockfd);

//================================
//函数名:do_server
//作者:marvin
//日期:2020.1.4
//功能:客户端链接上服务器后的入口
//输入参数:sockfd
//返回值:void
//修改记录:
//================================
void do_server(int sockfd);




#endif

